In [298]:
import numpy as np
import pandas as pd

In [299]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [300]:
df = pd.DataFrame(d)

In [301]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [302]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [303]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [304]:
df.fillna(value='s')

     A    B  C
0  1.0  5.0  1
1  2.0    s  2
2    s    s  3

In [305]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [306]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [307]:
data = {'company':['goog','goog','msft','msft','fb','fb'],
        'person':['sammy','charlie','ary','vantesa','carl jacobs', 'dog man sarah'],
        'sales':[200,120,340,124,243,350]}

In [308]:
df = pd.DataFrame(data)

In [309]:
df

  company         person  sales
0    goog          sammy    200
1    goog        charlie    120
2    msft            ary    340
3    msft        vantesa    124
4      fb    carl jacobs    243
5      fb  dog man sarah    350

In [310]:
byComp = df.groupby('company')

In [311]:
byComp.mean(numeric_only=True)

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [312]:
byComp.sum().loc['fb']

person    carl jacobsdog man sarah
sales                          593
Name: fb, dtype: object

In [313]:
df.groupby('company').max()

                person  sales
company
fb       dog man sarah    350
goog             sammy    200
msft           vantesa    340

In [314]:
df.groupby('company').min()

              person  sales
company
fb       carl jacobs    243
goog         charlie    120
msft             ary    124

In [315]:
df.groupby('company').describe().transpose()

company              fb        goog        msft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [316]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [317]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [318]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [319]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [320]:
def time2(x):
    return x * 2

In [321]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [322]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [323]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [324]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [325]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [326]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [327]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [328]:
df = pd.read_csv('example.csv')

In [329]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15